In [8]:
import pandas as pd
# List of Tuples
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
('Riti', 30, 'Delhi' , 'India' ) ,
('Vikas', 31, 'Mumbai' , 'India' ) ,
('Neelu', 32, 'Bangalore' , 'India' ) ,
('John', 16, 'New York' , 'US') ,
('Mike', 17, 'las vegas' , 'US')  ]
#Create a DataFrame object
dfObj = pd.DataFrame(students, columns = ['Name' , 'Age', 'City' , 'Country'], index=['a', 'b', 'c' , 'd' , 'e' , 'f'])

In [13]:
# Pass the row elements as key value pairs to append() function 
modDfObj = dfObj.append({'Name' : 'Sahil' , 'Age' : 22} , ignore_index=False)

TypeError: Can only append a Series if ignore_index=True or if the Series has a name

In [9]:
dfObj

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [12]:
modDfObj

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US
6  Sahil   22        NaN        NaN

In [16]:
df=pd.read_csv("StudentDetails.csv")
col_names =  ['Name','Date','Time']
attendance = pd.DataFrame(columns = col_names)

In [17]:
aa=df.loc[df['Name'] == name[re]].values
ab= aa[0][1]
print(ab)
aa

NameError: name 'name' is not defined

In [24]:
attendance

  Name  Date       Time
0   ab  date  timeStamp
1   ab  date  timeStamp
2   ab  date  timeStamp

In [23]:
attendance.loc[len(attendance)] = ['ab','date','timeStamp']

In [25]:
len(attendance)

3